Reports/А_СравнитьОстаткиДенегЕРПсBASБухгалтерия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>А_СравнитьОстаткиДенегЕРПсBASБухгалтерия</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредстваБезналичные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваБезналичные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КЗачислению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КСписанию</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЗаказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУЭквайера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваУПодотчетногоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Депозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеСредстваВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДенежныеДокументы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/А_СравнитьОстаткиДенегЕРПсBASБухгалтерия/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	УстановитьПривилегированныйРежим(Истина);

	// Отримання параметрів з СКД
	ПоДням = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ПоДням").Значение;
	ПараметрПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;
	НачалоПериода = ПараметрПериодОтчета.ДатаНачала;
	КонецПериода = КонецДня(ПараметрПериодОтчета.ДатаОкончания);

	// =============================================
	// 1. ЗАЛИШКИ ERP (РегістрБухгалтерії.Хозрасчетный)
	//    Рахунки: 311, 312, 313, 314, 315, 316 (в ієрархії СчетаВБанках)
	// =============================================
	ТаблицаБезналичныеДС_ЕРП = ПолучитьОстаткиЕРП_Бух(НачалоПериода, КонецПериода, Ложь);

	ТаблицаБезналичныеДС_ПоДнямЕРП = Новый ТаблицаЗначений;
	Если ПоДням Тогда
		ТаблицаБезналичныеДС_ПоДнямЕРП = ПолучитьОстаткиЕРП_Бух(НачалоПериода, КонецПериода, Истина);
	КонецЕсли;

	// =============================================
	// 2. ЗАЛИШКИ BUHBUD (COM + РегБух.Хозрасчетный)
	//    Рахунки: 311, 312, 313, 314, 315, 316 (в ієрархії СчетаВБанках)
	// =============================================
	СтрокаПодключенияBuhBud = "Srvr=""SQLSERVER"";Ref=""BuhBud"";Usr=""1cAdmin"";Pwd=""""";
	V8 = Новый COMОбъект("V83.COMConnector");

	Попытка
		V83 = V8.Connect(СокрЛП(СтрокаПодключенияBuhBud));
	Исключение
		Сообщить("Помилка підключення до BuhBud: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	ТаблицаБезналичныеДС_УПП = ПолучитьОстаткиBuhBud(V83, НачалоПериода, КонецПериода, Ложь);

	ТаблицаБезналичныеДС_ПоДнямУПП = Новый ТаблицаЗначений;
	Если ПоДням Тогда
		ТаблицаБезналичныеДС_ПоДнямУПП = ПолучитьОстаткиBuhBud(V83, НачалоПериода, КонецПериода, Истина);
	КонецЕсли;

	// Звільнення COM-з'єднання
	V83 = Неопределено;
	V8 = Неопределено;

	// =============================================
	// 3. ПЕРЕДАЧА В СКД
	// =============================================
	ВнешниеНаборыДанных = Новый Структура(
		"БезналичныеДС_ЕРП, БезналичныеДС_УПП, БезналичныеДС_ПоДнямЕРП, БезналичныеДС_ПоДнямУПП",
		ТаблицаБезналичныеДС_ЕРП,
		ТаблицаБезналичныеДС_УПП,
		ТаблицаБезналичныеДС_ПоДнямЕРП,
		ТаблицаБезналичныеДС_ПоДнямУПП
	);

	// Формування звіту
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Отримання залишків з ERP (РегістрБухгалтерії.Хозрасчетный, рахунки 31x)
//
// Параметри:
//  НачалоПериода - Дата - початок періоду
//  КонецПериода - Дата - кінець періоду
//  ПоДням - Булево - якщо Істина, то розбивка по днях
//
// Повертає:
//  ТаблицяЗначень - таблиця з залишками
//
Функция ПолучитьОстаткиЕРП_Бух(НачалоПериода, КонецПериода, ПоДням)

	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БанковскийСчетКасса",
		Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	Результат.Колонки.Добавить("ТипДенежныхСредств",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДенежныхСредств"));

	Если ПоДням Тогда
		Результат.Колонки.Добавить("СуммаНачальныйОстаток_ПоДнямЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаПриход_ПоДнямЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаРасход_ПоДнямЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаКонечныйОстаток_ПоДнямЕРП", ТипЧисло);
		Результат.Колонки.Добавить("ПериодДень", ОписаниеТиповДата);
	Иначе
		Результат.Колонки.Добавить("СуммаНачальныйОстаток_ЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаПриход_ЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаРасход_ЕРП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаКонечныйОстаток_ЕРП", ТипЧисло);
	КонецЕсли;

	Запрос = Новый Запрос;

	Если ПоДням Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК БанковскийСчетКасса,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток_ПоДнямЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаПриход КАК СуммаПриход_ПоДнямЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРасход КАК СуммаРасход_ПоДнямЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток_ПоДнямЕРП,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Период КАК ПериодДень
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты" ;
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК БанковскийСчетКасса,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток_ЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаПриход КАК СуммаПриход_ЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРасход КАК СуммаРасход_ЕРП,
		|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток_ЕРП,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств
		|ИЗ
		|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты" ;
		
	КонецЕсли;

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НС = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
		НС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Отримання залишків з BuhBud через COM (РегістрБухгалтерії.Хозрасчетный, рахунки 31x)
//
// Параметри:
//  V83 - COMОбъект - підключення до BuhBud
//  НачалоПериода - Дата - початок періоду
//  КонецПериода - Дата - кінець періоду
//  ПоДням - Булево - якщо Істина, то розбивка по днях
//
// Повертає:
//  ТаблицяЗначень - таблиця з залишками (з конвертованими посиланнями)
//
Функция ПолучитьОстаткиBuhBud(V83, НачалоПериода, КонецПериода, ПоДням)

	ТипЧисло = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2);
	ОписаниеТиповДата = Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата));

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("БанковскийСчетКасса",
		Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	Результат.Колонки.Добавить("ТипДенежныхСредств",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТипыДенежныхСредств"));

	Если ПоДням Тогда
		Результат.Колонки.Добавить("СуммаНачальныйОстаток_ПоДнямУПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаПриход_ПоДнямУПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаРасход_ПоДнямУПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаКонечныйОстаток_ПоДнямУПП", ТипЧисло);
		Результат.Колонки.Добавить("ПериодДень", ОписаниеТиповДата);
	Иначе
		Результат.Колонки.Добавить("СуммаНачальныйОстаток_УПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаПриход_УПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаРасход_УПП", ТипЧисло);
		Результат.Колонки.Добавить("СуммаКонечныйОстаток_УПП", ТипЧисло);
	КонецЕсли;

	Запрос = V83.NewObject("Запрос");

	Если ПоДням Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Субконто1 КАК БанковскийСчетКасса,
		|	Остатки.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток_ПоДнямУПП,
		|	Остатки.СуммаОборотДт КАК СуммаПриход_ПоДнямУПП,
		|	Остатки.СуммаОборотКт КАК СуммаРасход_ПоДнямУПП,
		|	Остатки.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток_ПоДнямУПП,
		|	Остатки.Период КАК ПериодДень
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|		&НачалоПериода,
		|		&КонецПериода,
		|		День,
		|		,
		|		Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках)),
		|		,
		|	) КАК Остатки
		|ГДЕ
		|	Остатки.СуммаНачальныйОстаток <> 0
		|	ИЛИ Остатки.СуммаОборотДт <> 0
		|	ИЛИ Остатки.СуммаОборотКт <> 0";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Субконто1 КАК БанковскийСчетКасса,
		|	Остатки.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток_УПП,
		|	Остатки.СуммаОборотДт КАК СуммаПриход_УПП,
		|	Остатки.СуммаОборотКт КАК СуммаРасход_УПП,
		|	Остатки.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток_УПП
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|		&НачалоПериода,
		|		&КонецПериода,
		|		,
		|		,
		|		Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках)),
		|		,
		|	) КАК Остатки
		|ГДЕ
		|	Остатки.СуммаНачальныйОстаток <> 0
		|	ИЛИ Остатки.СуммаОборотДт <> 0
		|	ИЛИ Остатки.СуммаОборотКт <> 0";
	КонецЕсли;

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	ТЗ = Запрос.Выполнить().Выгрузить();

	// Конвертація посилань BuhBud -> ERP через UUID
	Для Каждого СтрокаТЗ Из ТЗ Цикл
		НС = Результат.Добавить();

		Если ПоДням Тогда
			НС.ПериодДень = СтрокаТЗ.ПериодДень;
			НС.СуммаНачальныйОстаток_ПоДнямУПП = СтрокаТЗ.СуммаНачальныйОстаток_ПоДнямУПП;
			НС.СуммаПриход_ПоДнямУПП = СтрокаТЗ.СуммаПриход_ПоДнямУПП;
			НС.СуммаРасход_ПоДнямУПП = СтрокаТЗ.СуммаРасход_ПоДнямУПП;
			НС.СуммаКонечныйОстаток_ПоДнямУПП = СтрокаТЗ.СуммаКонечныйОстаток_ПоДнямУПП;
		Иначе
			НС.СуммаНачальныйОстаток_УПП = СтрокаТЗ.СуммаНачальныйОстаток_УПП;
			НС.СуммаПриход_УПП = СтрокаТЗ.СуммаПриход_УПП;
			НС.СуммаРасход_УПП = СтрокаТЗ.СуммаРасход_УПП;
			НС.СуммаКонечныйОстаток_УПП = СтрокаТЗ.СуммаКонечныйОстаток_УПП;
		КонецЕсли;

		// Зіставлення по UUID (BuhBud -> ERP)
		Попытка
			СсылкаБанкСчет = СтрокаТЗ.БанковскийСчетКасса;
			Если СтрокаТЗ.БанковскийСчетКасса <> Неопределено
				//И  V83.ЗначениеЗаполнено(СтрокаТЗ.БанковскийСчетКасса) 
				Тогда
				НС.БанковскийСчетКасса = А_Привилегированный.ПолучитьСправочникUID(
					"БанковскиеСчетаОрганизаций",
					V83.String(СтрокаТЗ.БанковскийСчетКасса.УникальныйИдентификатор()));
			КонецЕсли;
		Исключение
			// Якщо не вдалося знайти відповідність - залишаємо порожню посилку
		КонецПопытки;

		НС.ТипДенежныхСредств = Перечисления.ТипыДенежныхСредств.Безналичные;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
